        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Lab2.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT PeopleLab2 ASSIGN TO "PeopleLab2.dat"
        ORGANIZATION IS LINE SEQUENTIAL
        ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PeopleLab2.
01 PPeopleAttributes.
        02 PNAME PIC X(20).
        02 PDEGREE.
           03 PDEGREETYPE PIC X(4).
           03 PDEGREEYEAR PIC X(4).
WORKING-STORAGE SECTION.
01 SPeopleA.
        02 SPNAME PIC X(20).
        02 SDEGREE.
           03 SDEGREETYPE PIC X(4).
           03 SDEGREEYEAR PIC X(4).
        02 SFILLER PIC X(52).
01 FileEnd PIC A(1).

PROCEDURE DIVISION.
DISPLAY "Name"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
SPACES SPACES SPACES SPACES"Degree"SPACES SPACES"Year".
DISPLAY SPACES.

OPEN INPUT PeopleLab2.
        PERFORM UNTIL FileEnd='Y'
           READ PeopleLab2 INTO SPeopleA
                AT END MOVE 'Y' TO FileEnd
                NOT AT END DISPLAY SPNAME SDEGREETYPE SPACES SPACES SPACES SPACES SDEGREEYEAR
           END-READ
        END-PERFORM

CLOSE PeopleLab2.
        
STOP RUN.
